Revit 2027 API
ViewFamilyType.PlanViewDirection Property
 The PlanViewDirection of this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PlanViewDirection PlanViewDirection { get; set; }
Public Property PlanViewDirection As PlanViewDirection
	Get
	Set
public:
property PlanViewDirection PlanViewDirection {
	PlanViewDirection get ();
	void set (PlanViewDirection value);
}
member PlanViewDirection : PlanViewDirection with get, set
Property Value
PlanViewDirection
Exceptions
Exception | Condition
ArgumentException |  When setting this property: PlanViewDirection cannot be set to Undefined
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: View must be a Structural Plan
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace